Revit 2026 API

# FabricationUtilsExportToPCF Method

---
**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static void ExportToPCF(
	Document document,
	IList<ElementId> ids,
	string filename
)
```
```vb
Public Shared Sub ExportToPCF (
	document As Document,
	ids As IList(Of ElementId),
	filename As String
)
```
```cpp
public:
static void ExportToPCF(
	Document^ document,
	IList<ElementId^>^ ids,
	String^ filename
)
```
```fsharp
static member ExportToPCF :
        document : Document *
        ids : IList<ElementId> *
        filename : string -> unit
```

#### Parameters

document Document

ids IListElementId

filename String

#### Reference

FabricationUtils Class

Autodesk.Revit.DB.Fabrication Namespace